import{_ as e}from"./plugin-vue_export-helper-c27b6911.js";import{o as n,c as t,a as o}from"./app-0956f404.js";const c={};function r(_,a){return n(),t("div",null,[o(` 夫君子之行，静以修身，俭以养德。非淡泊无以明志，非宁静无以致远。夫学须静也，才须学也，非学无以广才，非志无以成学。淫慢则不能励精，险躁则不能治性。年与时驰，意与日去，遂成枯落，多不接世，悲守穷庐，将复何及！

### 好记性不如烂笔头

学习的重点之一是习惯的养成，写博客、做总结是学习很好的方法，导致工作两三年后水平停滞不前，最终工资被倒挂，甚至无力跳槽，这其中有一个重要的原因就是在入门的时候没有养成良好的学习习惯，比如看书必须记笔记，有了感悟最好写博客记录一下，发现知识盲区一定要去搜索权威文档而不是听信二手知识等等。

这些习惯我一直都有，并且受益良多。我觉得每个程序员都应该有这些好习惯，因此我用各种办法培养养成这些习惯。

所以，如果希望能够在编程（不只是前端）的路上保持前行，就要保持永不止步的心 `)])}const l=e(c,[["render",r],["__file","index.html.vue"]]);export{l as default};
